---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionRegistry.ListAllFailureDefinitions
source: html/64bc74c2-7a54-dbb9-2902-a32ed73f9a20.htm
---
# Autodesk.Revit.DB.FailureDefinitionRegistry.ListAllFailureDefinitions Method

Retrieves all the registered FailureDefinitions.

## Syntax (C#)
```csharp
public IList<FailureDefinitionAccessor> ListAllFailureDefinitions()
```

## Returns
All the registered FailureDefinitions.